[
  {
    "article_id": "https://www.bbc.com/sport/darts/articles/clyn1gw89gyo",
    "title": "Michael Smith reveals arthritis issue after World Masters defeat",
    "category": "entertainment",
    "tags": "Darts",
    "text": "Michael Smith has won seven televised titles in his career\nFormer world champion Michael Smith says he is suffering from arthritis in his right hand.\nSmith, whowon the world title in 2023,issued a statement after he was knocked out of the World Masters in Milton Keynes on Thursday by Dutchman Danny Noppert.\n\"I broke both my wrists when I was 19 and now it's catching up with me and now suffering with arthritis to my right hand,\"said Englishman Smith.,external\n\"This isn't sympathy or a cry for help. This is letting you all in to it. I've never given up or stopped from any pain.\"\nSmith, who throws with his right hand, hit a nine-darter immediately after Michael van Gerwen just missed one in what was described as the greatest leg of darts when winning the World Championship final in 2023.\nBut his form has dropped and he is down to number 16 in the world after losing in thesecond round of the World Championship.\nThe 34-year-old from St Helens, nicknamed 'Bully Boy', also said he has been suffering from a shoulder injury for the past six weeks which has required physiotherapy every two to three days.\n\"I see the specialist Monday and when I know, you will know, what will happen over the next month or so,\" he said.\n\"I'll never let anything beat me and I promise I'll be back very, very quickly.\"\nDefending champion Stephen Bunting survived a scare to battle past qualifier William Borland in a final-leg decider and book his place in the last 16 of the Masters.\nBunting, the world number five, has continued from his run to the World Championship semi-finals with impressive form, winning theBahrain Masters.\n'The Bullet' had to dig in after Scotland's Borland took the opening two sets and will play Peter Wright next.\nQualifier William O'Connor pulled off a shock 3-1 win over 2018 world champion Rob Cross - landing a 151 finish to knock out the Englishman, who last week won his fifth World Series title after beating Bunting in theDutch Masters final.\nWorld number one Luke Humphries beat 2022 Masters winner Joe Cullen 3-1 and will meet Northern Ireland's Josh Rock in the last 16 of the first ranking event of the new season.\nLuke Littler, who became theyoungest world champion aged 17last month, opens his Masters campaign against Andy Baetens on Friday.\nThis video can not be played\nWatch: The Rise of Luke Littler\nWorld Masters first-round results\nJosh Rock 3-1 Jermaine Wattimena\nDamon Heta 3-1 Ross Smith\nWilliam O'Connor 3-1 Rob Cross\nGerwyn Price 3-0 Florian Hempel\nPeter Wright 3-2 Kevin Doets\nLuke Humphries 3-1 Joe Cullen\nStephen Bunting 3-2 William Borland\nDanny Noppert 3-1 Michael Smith",
    "source": "BBC News",
    "date_published": "2025-01-31T08:39:33.567Z"
  },
  {
    "article_id": "https://www.bbc.com/sport/darts/articles/c4g9kkm0wnlo",
    "title": "Luke Littler: Josh Rock says he can challenge world champion",
    "category": "entertainment",
    "tags": "Darts, Northern Ireland Sport",
    "text": "Josh Rock believes he can challenge Luke Littler in future years\nNorthern Ireland's Josh Rock believes he can challenge Luke Littler's prospective dominance of professional darts in the future.\nLittler won his first world title at just 17 years old at Alexandra Palace earlier this month and appears well placed to emulate the kind of unprecedented supremacy enjoyed by legendary 16-time world champion Phil Taylor during his distinguished career.\nLittler's success came 12 months after he sprung to prominence by reaching the final of the World Championship.\nRock, 23, was tipped as the next big thing in the sport when he won the 2022 World Youth Darts Championship, breaking the record for the highest average in a final with an average of 104.13.\nThe County Antrim man has also won a number of Players Championship events and the 2024 Dutch Darts Championship.\n\"I had a solid 2024 but honestly I think 2025 is going to be my year,\" said Rock befor this week's World Masters in Milton Keynes.\n\"It is fantastic for the sport - Luke winning the Worlds at such a young age shows it is a young man's sport now.\"\nRock's best performance in a PDC premier event was a quarter-final appearance in the 2023 Grand Slam of Darts, which came 12 months after he became the first person to hit a televised nine-dart finish on debut at the same tournament.\n\"My game is there to challenge, it always has been, it just has to come out when it needs to.\n\"I 100 per cent believe it. There is six years between me and Luke. We can have a very long career, and I believe that me and him will dominate the sport.\"\nRock is scheduled to face Jermaine Wattimena on Thursday in the opening round of the restructured World Masters - a tournament Littler is entering for the first time.\nThe 18-year-old, who has failed to win either the Bahrain Masters or the Dutch Darts Masters since triumphing in the Worlds, will take on Andy Baetens from Belgium in the first round on Friday.",
    "source": "BBC News",
    "date_published": "2025-01-29T15:31:23.518Z"
  },
  {
    "article_id": "https://www.bbc.com/sport/mixed-martial-arts/articles/c5ye02zyl1no",
    "title": "UFC Saudi Arabia: Israel Adesanya feels like 'old dog' before Imavov fight",
    "category": "entertainment",
    "tags": "Mixed Martial Arts",
    "text": "Adesanya has contested 12 consecutive UFC title fights\nIsrael Adesanya says he feels like the \"old dog\" in the UFC whose job is to fend off the new generation.\nThe 35-year-old Nigerian-born New Zealander is a two-time former UFC champion and regarded as one of the greatest middleweights of all time.\nHe faces France's Nassourdine Imavov in Riyadh, Saudi Arabia on Saturday but approaches the contest after suffering successive defeats for the first time in his 13-year MMA career.\nAdesanya spoke recently of perhaps being a \"gatekeeper\" in the sport.\n\"I said 'gatekeeper' as a joke. I feel like the old dog and then there's the young guys coming up trying to prove themselves,\" said Adesanya.\n\"And it's my job to send them back down and let them know I'm still here.\n\"I feel if I lose my next 10 fights it wouldn't affect my legacy. This fight is important for me, not for anyone else. I'm doing this to prove to myself I'm still involved in this game, I'm still getting better, I'm still very dangerous.\"\nAdesanya lost his middleweight beltin a shock defeatby American Sean Strickland in 2023 beforelosing to South Africa's Dricus du Plessisthe following year in another title bout.\nHughes calls judging of loss 'pretty ridiculous'\nHughes beaten by Nurmagomedov in Bellator title bout\nThe contest with 28-year-old Imavov will be the first time in 13 fights Adesanya will be competing without a UFC championship on the line.\nImavov comes into the contest on a three-fight winning streak having last beaten American Brendan Allen in September.\n\"I'm kind of being selfish - I fight for my team, my family and my real fans, but this I'm doing for myself, it's really important to me,\" said Adesanya.\n\"I'm not chasing anything, I don't need anything. The belt always comes back around, I'm just doing what I love.\"\nMMA schedule and results 2025\nWatch every Born to Brawl episode\nNotifications, social media and more with BBC Sport",
    "source": "BBC News",
    "date_published": "2025-01-29T18:07:08.858Z"
  },
  {
    "article_id": "https://www.bbc.com/sport/darts/videos/c2038jvxqpvo",
    "title": "Watch: The Rise of Luke Littler",
    "category": "entertainment",
    "tags": "",
    "text": "There was an error\nFrom taking up darts as a toddler to his first World Championship title, Luke Littler's journey has led him to the summit of his sport and propelled darts into the limelight.\nWatchThe Rise of Luke Littleron iPlayer.\nAvailable to UK users only.\nWatch: The Rise of Luke Littler. Video, 00:01:06Watch: The Rise of Luke Littler\nUp Next. I'm not touching trophy unless I've won it - Littler. Video, 00:01:26I'm not touching trophy unless I've won it - Littler\nNo pressure on me in final - Littler. Video, 00:00:47No pressure on me in final - Littler\nBills 'cash in' on turnovers to beat Ravens. Video, 00:01:19Bills 'cash in' on turnovers to beat Ravens\nSuper Bowl bound Kansas City Chiefs 'not done yet' Video, 00:01:26Super Bowl bound Kansas City Chiefs 'not done yet'\nZidane, pranks and surfing on a trophy - Dupont takes our quiz. Video, 00:02:00Zidane, pranks and surfing on a trophy - Dupont takes our quiz\nPostecoglou proud of Spurs academy players. Video, 00:01:24Postecoglou proud of Spurs academy players\nRival African bids to bring F1 back to the continent. Video, 00:01:37Rival African bids to bring F1 back to the continent\n'This is mouthwatering stuff' - Champions League play-offs explained. Video, 00:03:29'This is mouthwatering stuff' - Champions League play-offs explained\n'Right now, no' - Guardiola on Man City Champions League chances. Video, 00:00:50'Right now, no' - Guardiola on Man City Champions League chances\n'It's a business, money talks!' - will Aston Villa sell Duran and Watkins? Video, 00:01:49'It's a business, money talks!' - will Aston Villa sell Duran and Watkins?\nFire breaks out outside Etihad Stadium. Video, 00:00:14Fire breaks out outside Etihad Stadium\nLiverpool's finishing is 'on another level' - Slot and Lineker talk goals. Video, 00:03:17Liverpool's finishing is 'on another level' - Slot and Lineker talk goals\nCan Arsenal win the Champions League? Video, 00:02:07Can Arsenal win the Champions League?\nBetter than the Bernabeu? How a new Man Utd stadium could take shape. Video, 00:06:59Better than the Bernabeu? How a new Man Utd stadium could take shape\nHow does British football food rate with European fans? Video, 00:01:39How does British football food rate with European fans?",
    "source": "BBC News",
    "date_published": ""
  },
  {
    "article_id": "https://www.bbc.com/sport/mixed-martial-arts/articles/cr53qgjvd3zo",
    "title": "UFC: Michael 'Venom' Page wants to face Leon Edwards in London",
    "category": "entertainment",
    "tags": "Mixed Martial Arts",
    "text": "Michael 'Venom' Page turns 38 in April and made his pro debut in 2012\nThe last time Michael 'Venom' Page contested an MMA fight at middleweight it was in Mumbai almost 12 years ago.\nPage, then 26, was appearing in just his fifth bout and was competing in India for the second time in five months.\nThe Englishman made short work of his opponent, securing a first-round submission.\nPage, who has fought most of his career as a welterweight, has good memories of the trip and remembers how naive he was to the professional world of MMA.\n\"I was still new to the sport. I didn't know what was good and bad. You can tell what's organised or not, but you didn't know if that was normal or not,\" Page said.\n\"When we were warming up for the fight, me and my opponent were basically warming up in the same room, which is weird.\"\nFast forward to 1 February 2025 and Page is facing unbeaten UFC middleweight sensation Sharabutdin Magomedov in Saudi Arabia.\nThey will not be expected to warm up in the same room before making their walks to the octagon.\n\"Shara has that [aura] around him but I can see in his ability something I can exploit,\" Page said.\n\"If I put the 'MVP' effect in front of him, it might ruin all of that. There is just something I saw there that made sense to me.\"\nAt 15-0, seven years his junior and on the hunt for a title shot at 185lb, Magomedov  is a daunting prospect for any middleweight, let alone a fighter stepping up in weight.\n'I feel like the old dog but I'm still very dangerous'\nHughes calls judging of loss 'pretty ridiculous'\nPage, 37, has a win anda losssince joining the UFC last year. He intends to return to welterweight and has his sights set on a title run.\nBut the opportunity to fight Magomedov, who has 12 knockouts in his 15 wins, was a challenge Page couldn't turn down. And it meant Page could still enjoy his Christmas dinner.\n\"I still had a good Christmas,\" he said.\n\"If there is exciting fights to be made at middleweight, I would happily take it. But the focus is a welterweight championship belt.\n\"I'm going to try and dedicate as much as my time at welterweight to get that belt and move up in the rankings.\"\nMagomedov, 30, won his last fight in incredible fashion against Armen Petrosyan, landing a right backfist before spinning round to land the same shot with his left hand.\nPage says no-one has been able to come up with the right gameplan to beat Magomedov, but feels his own \"unorthodox\" striking style will be perfect for his opponent's aggressive approach.\n\"Nobody's got it quite right yet. My time to show everyone,\" Page said.\n\"It's going to be an explosive fight and someone will walk on to something ugly.\n\"It's a great fight which is why I think so many people are excited for it because our styles looks like it'll create fireworks.\"\nMany fans expected Page to be included on the UFC London card, but the Briton said he agreed the Magomedov fight before theUFC confirmed the 22 March date.\nPage has fought several times in London when he was in Bellator and he \"100%\" wants to fight against British rival Leon Edwards in the near future.\nHe beat bitter rival Paul Daley in a huge all-British clash in 2019, but Bellator decided to do that fight in the United States.\n\"There is no way I am going to be in the UFC and not fight on a London card,\" Page said.\n\"Paul Daley, they did abroad, it was silly. It didn't need to happen the way it happened. I was annoyed at it back then, still annoyed at it now.\n\"It definitely should have happened in the UK. There's nowhere near as much malice between me and Leon, but it's equally an exciting fight to have.\n\"But it has to happen in the UK. I wouldn't let it happen anywhere else.\"\nMMA schedule and results 2025\nWatch every Born to Brawl episode\nNotifications, social media and more with BBC Sport\nComments can not be loaded\nTo load Comments you need to enable JavaScript in your browser",
    "source": "BBC News",
    "date_published": "2025-01-30T12:44:07.162Z"
  },
  {
    "article_id": "https://www.bbc.com/sport/mixed-martial-arts/articles/c8xqdqyyr0do",
    "title": "UFC: Bryce Mitchell comments about Adolf Hitler 'beyond disgusting', says UFC president Dana White",
    "category": "entertainment",
    "tags": "Mixed Martial Arts",
    "text": "Bryce Mitchell has a professional MMA record of 17 wins and two losses, with his past 10 fights contested in the UFC\nUFC president Dana White has condemned comments by fighter Bryce Mitchell about Adolf Hitler as \"beyond disgusting\".\nMitchell said the German dictator was a \"good guy\" and that \"the Holocaust ain't real\".\nThe 30-year-old American, ranked 13th in the featherweight division, made a range of antisemitic, homophobic and transphobic comments during the first episode of his podcast.\nWhite said: \"We reached out to Bryce immediately when we read what he said, and let him know exactly how we felt about it.\n\"But what he said was beyond disgusting and he needs a real education on the facts surrounding Hitler and World War Two.\"\nDespite White's condemnation, Mitchell, who last fought in December, has as yet faced no further action for his comments.\nWhite added: \"Hitler is one of the most disgusting and evil human beings to ever walk the earth, and anyone that even tries to take an opposing position is a moron.\n\"That's the problem with the internet and social media. You provide a platform to a lot of dumb and ignorant people.\"\nAs leader of the Nazi party, Hitler led Germany into World War Two and ordered the Holocaust genocide, in which six million Jews were murdered.\nMitchell has been fighting in the UFC promotion since 2018.\nCanadian-American combat sports journalist Ariel Helwani, who is Jewish,said on X:,external\"Each and every day MMA finds a way to reach a new low. A new way of embarrassing itself and those who are fans of it.\"\nHe added:,external\"Nothing will be done, and I don't even care if anything is done. Say what you want. It just continues to baffle me at how unbelievably stupid - not to mention bigoted - some of the people in the sport or associated with the sport can be.\"\nIn a statement to BBC Sport, the Anti-Defamation League's chief executive Jonathan Greenblatt said: \"I'm aghast at this podcast interview. There are simply no words.\n\"In the span of just a few minutes Mitchell manages to express antisemitic, homophobic, and transphobic sentiments.\n\"We hope the UFC will take immediate action to make clear that these ideas are noxious and have no place in the sport.\"\nMMA schedule and results 2025\nWatch every Born to Brawl episode\nNotifications, social media and more with BBC Sport",
    "source": "BBC News",
    "date_published": "2025-01-30T21:08:18.753Z"
  }
]